### DataFrame과 list, dict,  ndarray 상호변환

In [8]:
import numpy as np
import pandas as pd

col_name1 = ['col']
l1 = [1,2,3]            # 리스트 
array1 = np.array(l1)   # array 
print('array1 shape:', array1.shape) # array의 형태 

# 리스트를 활용하여 df 생성
df_l1 = pd.DataFrame(l1, columns=col_name1)
print('1차원 리스트로 생성한 df:\n',df_l1)

# 넘파이 array를 활용하여 df 생성
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 array로 생성한 df:\n',df_array1)

# dict를 활용하여 df 생성
df_dict1 = pd.DataFrame({'col':[1,2,3]})

array1 shape: (3,)
1차원 리스트로 생성한 df:
    col
0    1
1    2
2    3
1차원 array로 생성한 df:
    col
0    1
1    2
2    3

In [15]:
### 2차원의 df로 각 자료형들의 상호변환
col_name2 = ['col1','col2','col3']

l2 = [[1,2,3],
     [11,22,33]]

array2 = np.array(l2)
print('array2 shape:\n',array2.shape)

df_l2d = pd.DataFrame(l2,columns=col_name2)
print('2차원 리스트로 만든 df:\n',df_l2d)

df_array2d = pd.DataFrame(array2,columns=col_name2)
print('2차원 array로 만든 df:\n',df_array2d)

#dict 2차원으로 데이터 만들기
dict2d = {'col1':[1,11],
          'col2':[2,22],
         'col3':[3,33]}
df_dict2d = pd.DataFrame(dict2d)
df_dict2d

array2 shape:
 (2, 3)
2차원 리스트로 만든 df:
    col1  col2  col3
0     1     2     3
1    11    22    33
2차원 array로 만든 df:
    col1  col2  col3
0     1     2     3
1    11    22    33

   col1  col2  col3
0     1     2     3
1    11    22    33

In [32]:
# df를 ndarray로 변환
array3 = df_dict2d.values
print('df_dict.values 타입:',type(array3), '\ndf_dict.values의 shape:',array3.shape)

# df를 ndarray로 변환 후 list로 변환
l3 = df_dict2d.values.tolist()
print('\ndf_dict.values.tolist 타입:',type(l3))

# df를 dict로 변환
dict3 = df_dict2d.to_dict('list')
print('df_dict.to_dict의 타입:',type(dict3))
print(dict3)

df_dict.values 타입: <class 'numpy.ndarray'>
df_dict.values의 shape: (2, 3)

df_dict.values.tolist 타입: <class 'list'>
df_dict.to_dict의 타입: <class 'dict'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}

In [29]:
df_dict2d

   col1  col2  col3
0     1     2     3
1    11    22    33

## 데이터 핸들링 - titanic

www.kaggle.com/c/titanic/data

In [7]:
import pandas as pd
titan_df = pd.read_csv('./train.csv')
titan_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [8]:
print('titan_df의 shape:', titan_df.shape)

titan_df의 shape: (891, 12)

In [9]:
titan_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [10]:
titan_df.info() # 결측값이 확인됨 :: NA, NaN, Null

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [48]:
titan_df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [11]:
# 결측치 확인 - 단순대치 :: 대표값(최빈값, 중앙값, 평균)
titan_df.isna().sum()
titan_df['Age'] = titan_df['Age'].fillna(titan_df['Age'].mean())
titan_df.tail()

# 나머지 결측값을 한 번 바꾸겠습니다.

titan_df['Cabin']=titan_df['Cabin'].fillna('N')
titan_df['Cabin'].str[0:1].value_counts() # 참고) 해당열의 값이 40%이상이 결측치라면, 해당열 삭제

titan_df['Embarked']=titan_df.Embarked.fillna('N')
titan_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [12]:
## 새로운 컬럼 생성해보기
titan_df['ysp']='ysp'
titan_df['Age_by_10']=titan_df['Age']*10
titan_df.head()

## 생성된 컬럼 지우기
titan_df.drop(['ysp','Age_by_10'], axis=1) # 원본을 바꾸지 않는다
titan_df.drop(['ysp','Age_by_10'], axis=1, inplace=True) # 원본을 바꾼다

In [13]:
## 기존의 로우 지우기
titan_df.drop([0,1,2], axis=0) # inplace parameter로 원본수정을 조정가능

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.000000,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.000000,0,0,373450,8.0500,N,S
5,6,0,3,"Moran, Mr. James",male,29.699118,0,0,330877,8.4583,N,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.000000,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.000000,3,1,349909,21.0750,N,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.000000,0,0,211536,13.0000,N,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.000000,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,29.699118,1,2,W./C. 6607,23.4500,N,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.000000,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.000000,0,0,370376,7.7500,N,Q

In [17]:
#conditional indexing

cond1 = titan_df.Sex=='female'
cond2 = titan_df.Pclass==1
cond3 = titan_df.Age>=60

cond_titan_df=titan_df[(cond1&cond2&cond3)].reset_index(drop=True)

In [19]:
cond_titan_df.to_csv("./test_1.csv")